### **RIP Configuration Scenario**

#### **Network Setup**

- **Router A**:
    - `172.16.10.1/24`, `202.208.220.1/24`
- **Router B**:
    - `172.16.20.2/24`, `172.16.30.1/24`

#### **RIP Configuration**

1. **On Router A**:
    
    ```
    A(config)# router rip
    A(config-router)# network 172.16.0.0
    A(config-router)# network 202.208.220.0
    ```
    
2. **On Router B**:
    
    ```
    B(config)# router rip
    B(config-router)# network 172.16.0.0
    ```
    

#### **Result**

- **Router A** advertises `172.16.10.0/24` and `202.208.220.0/24` to **Router B**.
- **Router B** advertises `172.16.20.0/24` and `172.16.30.0/24` to **Router A**.
- Both routers now share routing information for traffic routing.

---

### **RIP Communication Overview**

1. **Configuration**:  
    Both routers are configured to use RIP to advertise their respective networks.
    
2. **Advertisement**:
    
    - Router A advertises the `172.16.10.0/24` network to Router B.
    - Router B advertises the `172.16.30.0/24` network to Router A.
3. **Data Packets**:  
    The RIP control packet contains network information, including network IDs and hop counts. When Router B receives this packet from Router A, it updates its routing table and learns the next hop (Router A's IP address) to reach Router Aâ€™s networks.
    
4. **Routing Tables**:
    
    - **Router A** learns about `172.16.30.0/24` through Router B.
    - **Router B** learns about `172.16.10.0/24` through Router A.
5. **Periodic Updates**:  
    RIP sends updates every 30 seconds to keep the routing tables current and up-to-date.
    

---

### **Passive-Interface Configuration**

RIP can be configured to stop sending updates on certain interfaces using the `passive-interface` command. This is useful when we want to receive RIP updates but prevent sending updates on an interface.

- **Example Configuration**:  
    Suppose Router A is connected to a network `202.208.220.0` and Router A doesn't want to send RIP updates on the interface connected to this network but still wants to receive updates.
    
    ```
    A(config)# router rip
    A(config-router)# passive-interface g0/0
    A(config-router)# network 202.208.220.0
    A(config-router)# passive-interface g0/2
    ```
    
    This configuration tells Router A not to send RIP updates on interface `g0/0` but still advertise the `202.208.220.0` network. It will also stop sending RIP updates out of interface `g0/2`.
    
##### **Important Note**

1. The **`network`** command is essential to enable RIP on an interface, even when `passive-interface` is used to stop sending updates on that interface.
2. The **`passive-interface`** command **does not block data traffic**. Data packets will still pass through the interface as usual, but RIP updates will not be sent out of the interface.
3. When **`passive-interface`** is used, RIP updates will not be passed to another router, but the router will still accept updates from the other router.

---

### **Example Scenario: Passive-Interface**

- **Network Setup**:  
    Router A is connected to Router B, forming a simple two-router setup: `A <--> B`.
    
- **Configuration on Router A**:
    
    - Apply `passive-interface` to the interface that connects to Router B. This will prevent Router A from sending RIP updates to Router B.
    
    ```
    A(config)# router rip
    A(config-router)# passive-interface g0/0
    A(config-router)# network 172.16.10.0
    ```
    
- **Explanation**:
    
    - **Router A** will not send RIP updates out of `g0/0` (interface connected to Router B) but will still receive RIP updates from Router B on that interface.
    - **Router B** will continue to send and receive RIP updates normally.

---